def Mannerheim():
    M = '''<!DOCTYPE html>
<html>
<head>
<title>Линия Маннергейма</title>
</head>
<body>
<body bgcolor="#e0e0e0">
<H1 align="center">Линия Маннергейма</H1>
<HR>
<img  src="59350926.gif" align="right" width="50%" height="50%" hspace="0" vspace="30" >
<h3> Об укреплении южной границы финны стали думать еще во время
 гражданской войны в 1918 году. Тогда же были составлены первые
планы укреплений.<br>
В 1919 году начальником финского генштаба стал генерал-майор Оскар
Энкель. При нем начались работы по созданию укреплений на Карельском 
Перешейке. По проекту 1921 года главная полоса обороны
проходила через Ключевое-Ермилово-Солдатское-оз.Глубокое-оз.Раковое-Вуокса.
 Тыловая оборонительная позиция защищала подходы к Выборгу.
<br>
В 1921-24 гг было построено 168 бетонных сооружений (114-пулеметных,
6-орудийных, остальные КП, убежища и т.п.). В главной линии - 18 узлов
обороны, промежутки между ними - 4-8 км. В каждый узел входило
несколько бетонно-каменных и дерево-земляных ДОТ, а также
противотанковые и противопехотные сооружения.Все бетонные сооружения этого периода - небольшие 1-этажные пулеметные
ДОТ фронтального огня из низкого качества бетона почти без армирования.
<br>
Следующий этап строительства - с 1932 года до начала войны (так и не был
 закончен - до сих пор валяются кучи окаменевшего цемента в виде
 мешков по всей Линии). В этот период строились 2-3-х амбразурные
пулеметные ДОТ фланкирующего огня, хорошо вписанные в местность и
прикрывающие друг друга.
<br>
 Использовался высококачаственный армированный
бетон, ДОТы имели боковые защитные стенки, бронезащиту и бронеколпаки.
 Бронелисты брали со складов взорванного в 1918 гогду форта Ино. Старые
сооружения модернизировались, либо превращались в укрытия.
В 1937 году появились первые ДОТы "милионники", прозванные так из-за
 своей дороговизны в постройке. Они представляли из себя разнесенные на
  40-60 метров боевые казематы, соединенные подземным ходом с
  подземными же укрытиями для личного состава.
<br>
К осени 1939 года в главной полосе были боеготовы 130 ДОТ (из них - 48
новых/ модернезированных) на 140 км. обороны. Так-же имелось около 130
км противотанковых препятствий и 330 км проволочных заграждений. Линию
дополняли полевые укрепления, участки
искуственного подтопления и минные поля.
<br>
В декабре 39-го года части РККА вышли к главной линии финской обороны, и попытались взять ее с ходу.
Атаки закончились огромными потерями. Линию, на которой было остановлено наступление, назвали "Линией Маннергейма",
 в честь командующего финскими войсками, бывшего русского генерала Карла Маннергейма.
 <br>
Через два месяца подготовки, обстрелов, бомбежек и непрерывных атак советские войска прорвали Линию Маннергейма в районе деревни Суммы (ур.Солдатское).
 Чтобы избежать окружения, финское командование приказало своим войскам оставить остальные укрепления и отойти на тыловую линию обороны у Выборга.
Летом 1940 года советские саперы подорвали все неуничтоженные в ходе войны сооружения Линии Маннергейма.</h3>
</body>
</html>'''.format(100,200)
    return M

M1 = Mannerheim()
print(M1)
